butok/FNET/fnet_demos/common/startup/startup_mk64fn1/CMSIS/Include/device/MK64F12/MK64F12_registers.h
/*! @brief Format value for bitfield CAU_ADR_CASR_DPE. */
#define BF_CAU_ADR_CASR_DPE(v) ((uint32_t)((uint32_t)(v) << BP_CAU_ADR_CASR_DPE) & BM_CAU_ADR_CASR_DPE)
/*@}*/

/*!
 * @name Register CAU_ADR_CASR, field VER[31:28] (WO)
 *
 * Values:
 * - 0001 - Initial CAU version
 * - 0010 - Second version, added support for SHA-256 algorithm.(This is the
 *     value on this device)
 */
/*@{*/
#define BP_CAU_ADR_CASR_VER  (28U)         /*!< Bit position for CAU_ADR_CASR_VER. */
#define BM_CAU_ADR_CASR_VER  (0xF0000000U) /*!< Bit mask for CAU_ADR_CASR_VER. */
#define BS_CAU_ADR_CASR_VER  (4U)          /*!< Bit field size in bits for CAU_ADR_CASR_VER. */

/*! @brief Format value for bitfield CAU_ADR_CASR_VER. */
#define BF_CAU_ADR_CASR_VER(v) ((uint32_t)((uint32_t)(v) << BP_CAU_ADR_CASR_VER) & BM_CAU_ADR_CASR_VER)
/*@}*/

/*******************************************************************************
 * HW_CAU_ADR_CAA - Accumulator register - Add to register command
 ******************************************************************************/

/*!
 * @brief HW_CAU_ADR_CAA - Accumulator register - Add to register command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_adr_caa
{
    uint32_t U;
    struct _hw_cau_adr_caa_bitfields
    {
        uint32_t ACC : 32;             /*!< [31:0] ACC */
    } B;
} hw_cau_adr_caa_t;

/*!
 * @name Constants and macros for entire CAU_ADR_CAA register
 */
/*@{*/
#define HW_CAU_ADR_CAA_ADDR(x)   ((uint32_t)(x) + 0x8C4U)

#define HW_CAU_ADR_CAA(x)        (*(__O hw_cau_adr_caa_t *) HW_CAU_ADR_CAA_ADDR(x))
#define HW_CAU_ADR_CAA_WR(x, v)  (HW_CAU_ADR_CAA(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_ADR_CAA bitfields
 */

/*!
 * @name Register CAU_ADR_CAA, field ACC[31:0] (WO)
 */
/*@{*/
#define BP_CAU_ADR_CAA_ACC   (0U)          /*!< Bit position for CAU_ADR_CAA_ACC. */
#define BM_CAU_ADR_CAA_ACC   (0xFFFFFFFFU) /*!< Bit mask for CAU_ADR_CAA_ACC. */
#define BS_CAU_ADR_CAA_ACC   (32U)         /*!< Bit field size in bits for CAU_ADR_CAA_ACC. */

/*! @brief Format value for bitfield CAU_ADR_CAA_ACC. */
#define BF_CAU_ADR_CAA_ACC(v) ((uint32_t)((uint32_t)(v) << BP_CAU_ADR_CAA_ACC) & BM_CAU_ADR_CAA_ACC)
/*@}*/

/*******************************************************************************
 * HW_CAU_ADR_CA0 - General Purpose Register 0 - Add to register command
 ******************************************************************************/

/*!
 * @brief HW_CAU_ADR_CA0 - General Purpose Register 0 - Add to register command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_adr_ca0
{
    uint32_t U;
    struct _hw_cau_adr_ca0_bitfields
    {
        uint32_t CA0 : 32;             /*!< [31:0] CA0 */
    } B;
} hw_cau_adr_ca0_t;

/*!
 * @name Constants and macros for entire CAU_ADR_CA0 register
 */
/*@{*/
#define HW_CAU_ADR_CA0_ADDR(x)   ((uint32_t)(x) + 0x8C8U)

#define HW_CAU_ADR_CA0(x)        (*(__O hw_cau_adr_ca0_t *) HW_CAU_ADR_CA0_ADDR(x))
#define HW_CAU_ADR_CA0_WR(x, v)  (HW_CAU_ADR_CA0(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_ADR_CA0 bitfields
 */

/*!
 * @name Register CAU_ADR_CA0, field CA0[31:0] (WO)
 */
/*@{*/
#define BP_CAU_ADR_CA0_CA0   (0U)          /*!< Bit position for CAU_ADR_CA0_CA0. */
#define BM_CAU_ADR_CA0_CA0   (0xFFFFFFFFU) /*!< Bit mask for CAU_ADR_CA0_CA0. */
#define BS_CAU_ADR_CA0_CA0   (32U)         /*!< Bit field size in bits for CAU_ADR_CA0_CA0. */

/*! @brief Format value for bitfield CAU_ADR_CA0_CA0. */
#define BF_CAU_ADR_CA0_CA0(v) ((uint32_t)((uint32_t)(v) << BP_CAU_ADR_CA0_CA0) & BM_CAU_ADR_CA0_CA0)
/*@}*/

/*******************************************************************************
 * HW_CAU_ADR_CA1 - General Purpose Register 1 - Add to register command
 ******************************************************************************/

/*!
 * @brief HW_CAU_ADR_CA1 - General Purpose Register 1 - Add to register command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_adr_ca1
{
    uint32_t U;
    struct _hw_cau_adr_ca1_bitfields
    {
        uint32_t CA1 : 32;             /*!< [31:0] CA1 */
    } B;
} hw_cau_adr_ca1_t;

/*!
 * @name Constants and macros for entire CAU_ADR_CA1 register
 */
/*@{*/
#define HW_CAU_ADR_CA1_ADDR(x)   ((uint32_t)(x) + 0x8CCU)

#define HW_CAU_ADR_CA1(x)        (*(__O hw_cau_adr_ca1_t *) HW_CAU_ADR_CA1_ADDR(x))
#define HW_CAU_ADR_CA1_WR(x, v)  (HW_CAU_ADR_CA1(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_ADR_CA1 bitfields
 */

/*!
 * @name Register CAU_ADR_CA1, field CA1[31:0] (WO)
 */
/*@{*/
#define BP_CAU_ADR_CA1_CA1   (0U)          /*!< Bit position for CAU_ADR_CA1_CA1. */
#define BM_CAU_ADR_CA1_CA1   (0xFFFFFFFFU) /*!< Bit mask for CAU_ADR_CA1_CA1. */
#define BS_CAU_ADR_CA1_CA1   (32U)         /*!< Bit field size in bits for CAU_ADR_CA1_CA1. */

/*! @brief Format value for bitfield CAU_ADR_CA1_CA1. */
#define BF_CAU_ADR_CA1_CA1(v) ((uint32_t)((uint32_t)(v) << BP_CAU_ADR_CA1_CA1) & BM_CAU_ADR_CA1_CA1)
/*@}*/

/*******************************************************************************
 * HW_CAU_ADR_CA2 - General Purpose Register 2 - Add to register command
 ******************************************************************************/

/*!
 * @brief HW_CAU_ADR_CA2 - General Purpose Register 2 - Add to register command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_adr_ca2
{
    uint32_t U;
    struct _hw_cau_adr_ca2_bitfields
    {
        uint32_t CA2 : 32;             /*!< [31:0] CA2 */
    } B;
} hw_cau_adr_ca2_t;

/*!
 * @name Constants and macros for entire CAU_ADR_CA2 register
 */
/*@{*/
#define HW_CAU_ADR_CA2_ADDR(x)   ((uint32_t)(x) + 0x8D0U)

#define HW_CAU_ADR_CA2(x)        (*(__O hw_cau_adr_ca2_t *) HW_CAU_ADR_CA2_ADDR(x))
#define HW_CAU_ADR_CA2_WR(x, v)  (HW_CAU_ADR_CA2(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_ADR_CA2 bitfields
 */

/*!
 * @name Register CAU_ADR_CA2, field CA2[31:0] (WO)
 */
/*@{*/
#define BP_CAU_ADR_CA2_CA2   (0U)          /*!< Bit position for CAU_ADR_CA2_CA2. */
#define BM_CAU_ADR_CA2_CA2   (0xFFFFFFFFU) /*!< Bit mask for CAU_ADR_CA2_CA2. */
#define BS_CAU_ADR_CA2_CA2   (32U)         /*!< Bit field size in bits for CAU_ADR_CA2_CA2. */

/*! @brief Format value for bitfield CAU_ADR_CA2_CA2. */
#define BF_CAU_ADR_CA2_CA2(v) ((uint32_t)((uint32_t)(v) << BP_CAU_ADR_CA2_CA2) & BM_CAU_ADR_CA2_CA2)
/*@}*/

